stresstest/test.yml
config:
  target: "http://127.0.0.1:3003"
  phases:
    - duration: 10
      arrivalRate: 20
scenarios:
  - flow:
    - loop:
      - get:
          url: "/listings/{{ $loopElement }}"
      over:
        - 5
        - 5
        - 5
        - 5
        - 5
        - 5
        - 86
        - 86
        - 86
        - 86
        - 86
        - 86
        - 86
        - 86
        - 86
        - 86
        - 86
        - 86
        - 86
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 46214
        - 46214
        - 46214
        - 46214
        - 46214
        - 46214
        - 46214
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 99999
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 123
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 48498
        - 1
        - 1
        - 1
        - 1
        - 26
        - 26
        - 26
        - 26
        - 26
        - 26
        - 26
        - 26
        - 26
        - 26
      count: 30